In [1]:
import pandas as pd

In [2]:
scientists = pd.read_csv('./data/scientists.csv')

In [3]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

#### 데이터를 피클, csv, tsv 파일로 저장하고 불러오기

In [8]:
names = scientists['Name']
names.to_pickle('./output/scientists_names_series.pickle')
scientists.to_pickle('./output/scientists_df.pickle')

In [10]:
scientists_names_from_pickle = pd.read_pickle('./output/scientists_names_series.pickle')
print(scientists_names_from_pickle)

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [11]:
names.to_csv('./output/scientist_names_series.csv')
scientists.to_csv('./output/scientists_df.tsv', sep='\t')

#### 시리즈와 데이터프레임을 엑셀 파일로 저장하기
- 시리즈는 to_frame이라는 메서드를 사용해 데이터프레임으로 변환한 다음 엑셀 파일로 저장해야 합니다.

In [12]:
import xlwt
import openpyxl

In [13]:
names_df = names.to_frame()
# xls 확장자 저장을 위해 xlwt 필요
names_df.to_excel('./output/scientists_names_series_df.xls')
# xlsx 확장자 저장을 위해 openpyxl 필요
names_df.to_excel('./output/scientists_names_series_df.xlsx')

C:\Users\rkdtk\AppData\Local\Temp/ipykernel_19532/1620047502.py:3: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  names_df.to_excel('./output/scientists_names_series_df.xls')